Revit 2027 API
BuiltInExternalDataManagerCommands Properties
The ExternalDataManagerCommands.BuiltInExternalDataManagerCommands type exposes the following members.
Properties
Name | Description
Add |  Add new external data.
Import |  Import external data into Revit model.
ManageWorksets |  Manage workset for external data.
PlaceInstance |  Place a external data into Revit model.
Reload |  Remove external data.
ReloadFrom |  Reload external data from specified location.
Remove |  Unload external data.
Show |  Show a external data in canvas.
Unload |  Unload external data.
Top
See Also
Reference
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands Class
Autodesk.Revit.UI Namespace